// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.



let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length < 3){
    console.log("Це маленький масив");
}
else {
    console.log("Це велкий масив");
}



// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
// Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let a = 3;
let b = 30;
let c = 6;

if (a > b && a < c || a < b && a > c){
    console.log(a);
}
else if (b > a && b < c || b < a && b > c){
    console.log(b);
}
else if (c > a && c < b || c < a && c > b){

    console.log(c);
}
else {
    console.log("Error");
}


// - Перепишіть конструкцію if з використанням умовного оператора '?':
// let result;
// if (a + b < 4) {
//    result = 'Мало';
// } else {
//    result = 'Багато';
// }

let aa = 1;
let bb = 2;
let result = (aa + bb < 4) ? 'Мало' : 'Багато';
console.log(result);

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором


let number = -5;
let result2 = (number > 0) ? 'позитивне' : (number < 0) ? 'негативне' : 'нуль';
console.log(result2);


// - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)


let test = true;
let result3 = (test === true) ? 'Вірно' : 'Неправильно';
console.log(result3);

// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

let ask = prompt("Яка «офіційна» назва JavaScript?");
console.log((ask === "ECMAScript") ? "Правильно!" : "Не знаєте? ECMAScript!");


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
// Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let house = prompt("Введіть номер квартири");
console.log((house < 20 ) ? "Перший підїзд" : (house > 20 && house < 48) ? "Другий підїзд" : (house > 48 && house < 90) ? "Третій підїзд" : "Такої квартири немає" );

// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО


let number2 = +prompt("Введіть число");
console.log((number2 === 10) ? "ВІРНО" : "НЕВІРНО");


// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temperature = +prompt("Введіть температуру");
console.log((temperature >= 10 && temperature <= 22) ? "Ми йдемо ВЧИТИСЯ" : "Сидимо вдома і вчимося ОНЛАЙН");


// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let number_3 = +prompt("Введіть число від 1 до 5");
switch (number_3) {
    case 1:
        console.log("Авто");
        break;
    case 2:
        console.log("Мото");
        break;
    case 3:
        console.log("Телефон");
        break;
    case 4:
        console.log("Ноутбук");
        break;
    case 5:
        console.log("Пральна машина");
        break;
    default:
        console.log("Число невірне");

}